#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
module.asics_cluster.aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
module.iam.data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_codestarconnections_connection.github_connection: Refreshing state... [id=arn:aws:codestar-connections:eu-west-1:802288441694:connection/1b430daa-4436-49d6-a3a6-bd27b73947db]
aws_cloudwatch_log_group.gtw_service_log_group: Refreshing state... [id=/ecs/gtw-service]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_cloudwatch_log_group.bff_service_log_group: Refreshing state... [id=/ecs/bff-service]
aws_cloudwatch_log_group.redis_cache_log_group: Refreshing state... [id=/cache/redis]
aws_codebuild_project.build_project: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project]
aws_security_group.gtw_lb: Refreshing state... [id=sg-0ddc9f6d8fb60802e]
aws_elasticache_subnet_group.redis_subnet_group: Refreshing state... [id=redis-subnet-group]
aws_cloudwatch_log_stream.gtw_service_log_stream: Refreshing state... [id=gtw-service-log-stream]
aws_security_group.gtw_ecs_tasks: Refreshing state... [id=sg-0f505df8b5227d2be]
aws_cloudwatch_log_stream.bff_service_log_stream: Refreshing state... [id=bff-service-log-stream]
aws_cloudwatch_log_stream.redis_cache_log_stream: Refreshing state... [id=redis-log-stream]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-06e777883e1f5464b]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_codepipeline.codepipeline: Refreshing state... [id=bff-pipeline]
aws_security_group.redis_sg: Refreshing state... [id=sg-0c9a22295813f5385]
aws_elasticache_replication_group.redis: Refreshing state... [id=my-redis-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_elasticache_replication_group.redis has been deleted
  - resource "aws_elasticache_replication_group" "redis" {
      - id                             = "my-redis-cluster" -> null
        tags                           = {
            "Name" = "my-redis-cluster"
        }
        # (32 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_security_group.ecs_tasks has been deleted
  - resource "aws_security_group" "ecs_tasks" {
      - id                     = "sg-06e777883e1f5464b" -> null
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.gtw_ecs_tasks has been deleted
  - resource "aws_security_group" "gtw_ecs_tasks" {
      - id                     = "sg-0f505df8b5227d2be" -> null
        name                   = "gtw-ecs-tasks-security-group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.gtw_lb has been deleted
  - resource "aws_security_group" "gtw_lb" {
      - id                     = "sg-0ddc9f6d8fb60802e" -> null
        name                   = "gtw-load-balancer-security-group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.lb has been deleted
  - resource "aws_security_group" "lb" {
      - id                     = "sg-05b6da332a709d6c8" -> null
        name                   = "cb-load-balancer-security-group"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.redis_sg has been deleted
  - resource "aws_security_group" "redis_sg" {
      - id                     = "sg-0c9a22295813f5385" -> null
        name                   = "redis-sg"
        tags                   = {
            "Name" = "redis-sg"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_elasticache_replication_group.redis_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_elasticache_replication_group" "redis_cluster" {
      + arn                            = (known after apply)
      + auth_token_enabled             = (known after apply)
      + automatic_failover_enabled     = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + description                    = (known after apply)
      + id                             = (known after apply)
      + log_delivery_configuration     = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = (known after apply)
      + node_type                      = (known after apply)
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + port                           = (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = (known after apply)
      + snapshot_retention_limit       = (known after apply)
      + snapshot_window                = (known after apply)
    }

  # aws_codebuild_project.build_project will be updated in-place
  ~ resource "aws_codebuild_project" "build_project" {
        id                     = "arn:aws:codebuild:eu-west-1:802288441694:project/bff-codebuild-project"
        name                   = "bff-codebuild-project"
      ~ service_role           = "arn:aws:iam::802288441694:role/codebuild-role" -> (known after apply)
        tags                   = {}
        # (8 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_codepipeline.codepipeline will be updated in-place
  ~ resource "aws_codepipeline" "codepipeline" {
        id       = "bff-pipeline"
        name     = "bff-pipeline"
      ~ role_arn = "arn:aws:iam::802288441694:role/codepipeline-role" -> (known after apply)
        tags     = {}
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = "false"
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Redis replication group with cluster mode enabled"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = "tue:06:30-tue:07:30"
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.t2.micro"
      + num_cache_clusters             = (known after apply)
      + num_node_groups                = 2
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = "default.redis7.cluster.on"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = 1
      + replication_group_description  = (known after apply)
      + replication_group_id           = "my-redis-cluster"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = "01:00-02:00"
      + subnet_group_name              = "redis-subnet-group"
      + tags                           = {
          + "Name" = "my-redis-cluster"
        }
      + tags_all                       = {
          + "Name" = "my-redis-cluster"
        }
      + transit_encryption_enabled     = (known after apply)

      + log_delivery_configuration {
          + destination      = "/cache/redis"
          + destination_type = "cloudwatch-logs"
          + log_format       = "text"
          + log_type         = "slow-log"
        }
    }

  # aws_elasticache_subnet_group.redis_subnet_group will be updated in-place
  ~ resource "aws_elasticache_subnet_group" "redis_subnet_group" {
        id          = "redis-subnet-group"
        name        = "redis-subnet-group"
      ~ subnet_ids  = [
          - "subnet-036a5e724b44fa8df",
          - "subnet-0a15b82f75b3300cd",
        ] -> (known after apply)
        tags        = {
            "Name" = "redis-subnet-group"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "allow inbound access from the ALB only"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8081
            },
        ]
      + name                   = "cb-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.gtw_ecs_tasks will be created
  + resource "aws_security_group" "gtw_ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "gtw-ecs-tasks-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.gtw_lb will be created
  + resource "aws_security_group" "gtw_lb" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "gtw-load-balancer-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb will be created
  + resource "aws_security_group" "lb" {
      + arn                    = (known after apply)
      + description            = "controls access to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "cb-load-balancer-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.redis_sg will be created
  + resource "aws_security_group" "redis_sg" {
      + arn                    = (known after apply)
      + description            = "Allow access to Redis"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow ECS service access to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow ECS service access to Redis"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "redis-sg"
        }
      + tags_all               = {
          + "Name" = "redis-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.bff_alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "bff-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.bff_alb.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.bff_alb.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "bff-service-tg"
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # module.ecs_bff.aws_ecs_service.service[0] will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bff-service"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_bff.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "bff-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.ecs_gtw.aws_ecs_service.service[0] will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/asics_cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bff-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "gtw-service"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_gtw.aws_ecs_task_definition.task[0] will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "gtw-task"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
    }

  # module.gtw_alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "gtw-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.gtw_alb.aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.gtw_alb.aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "gtw-service-tg"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }
    }

  # module.iam.aws_iam_role.codebuild_role will be created
  + resource "aws_iam_role" "codebuild_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_auto_scale_role will be created
  + resource "aws_iam_role" "ecs_auto_scale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EcsAutoScaleRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codebuild_service_role_policy will be created
  + resource "aws_iam_role_policy" "codebuild_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:ListBucket",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetProjects",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeVpcs",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codedeploy_service_role_policy will be created
  + resource "aws_iam_role_policy" "codedeploy_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                          + "ecs:DescribeTaskDefinition",
                          + "ecs:DescribeTasks",
                          + "ecs:ListTasks",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DescribeRule",
                          + "lambda:InvokeFunction",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketVersioning",
                          + "application-autoscaling:RegisterScalableTarget",
                          + "application-autoscaling:DeleteScalingPolicy",
                          + "application-autoscaling:DeregisterScalableTarget",
                          + "application-autoscaling:DescribeScalableTargets",
                          + "application-autoscaling:PutScalingPolicy",
                          + "application-autoscaling:DescribeScalingPolicies",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:DeleteAlarms",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy.codepipeline_service_role_policy will be created
  + resource "aws_iam_role_policy" "codepipeline_service_role_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "codepipeline:*",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetProjects",
                          + "codebuild:BatchGetBuildBatches",
                          + "codebuild:ListBuildsForProject",
                          + "codedeploy:RegisterApplicationRevision",
                          + "codedeploy:GetApplicationRevision",
                          + "codedeploy:GetDeploymentConfig",
                          + "codedeploy:CreateDeployment",
                          + "codedeploy:GetDeployment",
                          + "codedeploy:GetDeploymentGroup",
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketVersioning",
                          + "s3:PutBucketVersioning",
                          + "s3:PutBucketAcl",
                          + "s3:GetBucketAcl",
                          + "cloudwatch:*",
                          + "codestar-connections:UseConnection",
                          + "iam:PassRole",
                          + "lambda:InvokeFunction",
                          + "lambda:GetFunctionConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.codebuild_attach will be created
  + resource "aws_iam_role_policy_attachment" "codebuild_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeBuildDeveloperAccess"
      + role       = "codebuild-role"
    }

  # module.iam.aws_iam_role_policy_attachment.codedeploy_attach will be created
  + resource "aws_iam_role_policy_attachment" "codedeploy_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "codedeploy-role"
    }

  # module.iam.aws_iam_role_policy_attachment.codepipeline_attach will be created
  + resource "aws_iam_role_policy_attachment" "codepipeline_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodePipeline_FullAccess"
      + role       = "codepipeline-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_auto_scale_role will be created
  + resource "aws_iam_role_policy_attachment" "ecs_auto_scale_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole"
      + role       = "EcsAutoScaleRole"
    }

  # module.iam.aws_iam_role_policy_attachment.task_s3 will be created
  + resource "aws_iam_role_policy_attachment" "task_s3" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "ecs-task-role"
    }

  # module.vpc.aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.internet_access will be created
  + resource "aws_route" "internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.17.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.17.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags_all                             = (known after apply)
    }

Plan: 38 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*